[
  [
    {
      "pos": "Technology Consultant",
      "group": "Emory University Student Digital Life",
      "groupurl": "https://ats.emory.edu/sdl/",
      "date": "Aug 2023 - Present",
      "desc": "Maintain friendly environment free of technical difficulties for students and faculty by managing CCCH's A/V system. Provide a secure, up-to-date online experience for 200+ students by servicing CCCH's 32 computers and 4 printers.",
      "skills": ["Debugging", "Operating Systems", "Networking"]
    },
    {
      "pos": "Software Engineer",
      "group":  "Kerygma Digital",
      "groupurl": "https://kerygma.digital/",
      "date": "Jun 2023 - Jul 2023",
      "desc": "Reduced service response latency by 60% (~400 ms) by implementing a custom configurable time-to-live HTTP cache in order to create a more responsive experience for 5m+ BibleBot users across 60,000+ Discord server. Decreased HTML and JSON cache usage by 99% and 39% by creating custom middleware to strip stored responses.",
      "skills": ["C#", "ASP.NET", "MongoDB Atlas", "Git"]
    }
  ],
  [
    {
      "pos": "Head Project Lead",
      "group": "Project Emory",
      "groupurl": "https://github.com/PROJECT-Emory-2023",
      "date": "Aug 2023 - Present",
      "desc": "Lead development of RIDEmory's backend services in order to provide easy access to automatically compiled rideshare information across Emory's campus. Teach technologies such as Spring Boot, MongoDB, React, and Git through guided practice to provide working CS experience to 20+ members as Emory's only open project-building club.",
      "skills": ["Java", "Spring Boot", "MongoDB Atlas", "React", "JavaScript", "Flask", "Git"]
    },
    {
      "pos": "Software Engineer",
      "group": "Emory Hack4Impact",
      "groupurl": "https://emory-hack4impact.github.io/",
      "date": "Dec 2023 - Present",
      "desc": "Design and develop an internal operations webpage including an announcements board, HR service page, personal dashboard, and resources page to provide Odyssey Family Consulting Center with a unified employee experience. Build and maintain software solutions for non-profits in Atlanta to enable better community service.",
      "skills": ["HTML", "CSS", "JavaScript", "Figma", "Git"]
    }
  ]
]